app/views/students/_form.html.slim

SELECT "subjects".* FROM "subjects"
---
      SELECT SUBJECTS:
        = form.select :subject_ids, options_from_collection_for_select(Subject.all.sort_by(&:name), :id, :name, form.object.subject_ids), {}, include_blank: true, multiple: true, class: "collect-form col-md-12"