app/views/subjects/show.html.erb

SELECT "students".* FROM "students" INNER JOIN "student_subjects" ON "students"."id" = "student_subjects"."student_id" WHERE "student_subjects"."subject_id" = $1  [["subject_id", 1]]
---
Enrolled Students:<br>
  <% @subject.students.each do |s| %>