app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("last_name", "first_name", "course", "age", "birthday", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "updated_at" = $1 WHERE "students"."id" = $2  [["updated_at", "2020-03-18 08:58:57.218892"], ["id", 3]]

  def destroy_student
    @student.destroy
---
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 1]]