app/controllers/student_subjects_controller.rb

SELECT "student_subjects".* FROM "student_subjects"
---
  def index
    @student_subjects = StudentSubject.all