app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("name", "description", "code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Coe123"], ["description", "Computer Texch"], ["code", "BC52344"], ["created_at", "2020-03-13 06:35:38.246562"], ["updated_at", "2020-03-13 06:35:38.246562"]]

    def set_subject
      @subject = Subject.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]